Revit 2027 API
ReferenceIntersector(ElementFilter, FindReferenceTarget, View3D) Constructor
 Constructs a ReferenceIntersector which is set to return intersections from any element which passes an input filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ReferenceIntersector(
	ElementFilter filter,
	FindReferenceTarget targetType,
	View3D view3d
)
Public Sub New (
	filter As ElementFilter,
	targetType As FindReferenceTarget,
	view3d As View3D
)
public:
ReferenceIntersector(
	ElementFilter^ filter,
	FindReferenceTarget targetType,
	View3D^ view3d
)
new :
        filter : ElementFilter *
        targetType : FindReferenceTarget *
        view3d : View3D -> ReferenceIntersector
Parameters
filter ElementFilter
 The element filter. All references will belong to elements passing this filter.
targetType FindReferenceTarget
 The target type of references to return.
view3d View3D
 The view in which to find references.
Exceptions
Exception | Condition
ArgumentException |  Returns true if the view is not a view template.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ReferenceIntersector Class
ReferenceIntersector Overload
Autodesk.Revit.DB Namespace